#include "fun.h"
void bubbleSort(int arrForSort[], int n)//функція бульбашкового сортування
{
    int buff = 0; // для тимчасового зберігання значення, під час перезапису

    for (int i = 0; i < n - 1; i++)
    {
        for (int j = n - 1; j > i; j--)
        {
            /*  вкладений цикл проходить від n елемента
                до першого, знаходить за допомогою if саме "легке" значення,
                порівнюючи сусідні пари елементів,
                і піднімає його в нульову комірку масиву                    */
            if (arrForSort[j] < arrForSort[j - 1])
            {

                buff = arrForSort[j - 1];
                arrForSort[j - 1] = arrForSort[j];
                arrForSort[j] = buff;
                for (int o = 0; o < n; o++)
                {
                    printf("%i\t", arrForSort[o]);
                }
                printf("\n");
                /*Цикл який выводить зміни в масиві*/
            }
        }
        /*  далі значення i збільшується на 1
            і внутрішній цикл буде перебирати елементи
            від n до другого. Таким чином підніме саме
            "Легке" значення з решти в перший осередок і т.д. */
    }
}